tutorials/verificationAndValidation/axisymmetricHemispherical/sim/interPlicPhaseChangeFoam/cavNum02/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

interpolationSchemes
{
    default             linear;
}

divSchemes
{
    default             none;
    div(rhoPhi,U)       Gauss linearUpwind grad(U);
    div(phi,omega)      Gauss upwind;
    div(phi,k)          Gauss upwind;
    div(phi,alpha)      Gauss vanLeer;
    div(phirb,alpha)    Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

gradSchemes
{
    default             cellLimited fourth 1.0;
}

laplacianSchemes
{
    default             Gauss linear uncorrected;
}

snGradSchemes
{
    default             uncorrected;
}


// ************************************************************************* //
